---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.ElementWillBeDetachedFromPlane
source: html/4950e9fe-eb9e-9c50-5cc8-b7407884f143.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.ElementWillBeDetachedFromPlane Property

Element will be detached from its associated plane

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementWillBeDetachedFromPlane { get; }
```